Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Dev Services for Kafka relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker address using `kafka.bootstrap.servers`.
ja_jp: Dev Services for Kafkaでは、ブローカーの起動にDockerを使用しています。お使いの環境でDockerがサポートされていない場合は、ブローカーを手動で起動するか、すでに稼働しているブローカーに接続する必要があります。ブローカーのアドレスは、 `kafka.bootstrap.servers` を使用して設定できます。

source: Dev Services for Kafka starts the container with the `quarkus-dev-service-kafka` label which is used to identify the container.
ja_jp: Dev Services for Kafka は、コンテナを識別するために使用される `quarkus-dev-service-kafka` のラベルでコンテナを開始します。

source: Dev Services for Kafka supports https://redpanda.com[Redpanda] and https://strimzi.io[Strimzi] (in https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] mode).
ja_jp: Dev Services for Kafkaは、 link:https://redpanda.com[Redpanda] と link:https://strimzi.io[Strimzi]（ link:https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] モード）をサポートしています。

source: Dev Services for Kafka supports https://redpanda.com[Redpanda], https://github.com/ozangunalp/kafka-native[kafka-native] and https://strimzi.io[Strimzi] (in https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] mode) images.
ja_jp: Dev Services for Kafkaは link:https://redpanda.com[Redpanda] 、 link:https://github.com/ozangunalp/kafka-native[kafka-native] 、 link:https://strimzi.io[Strimzi] （ link:https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] モード）のイメージをサポートします。

source: Dev Services for Kafka supports https://redpanda.com[Redpanda], https://github/ozangunalp/kafka-native[kafka-native] and https://strimzi.io[Strimzi] (in https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] mode) images.
ja_jp: Dev Services for Kafkaは、 link:https://redpanda.com[Redpanda] とhttps://github/ozangunalp/kafka-native[kafka-native]、 link:https://strimzi.io[Strimzi]（ link:https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] モード）イメージをサポートしています。

source: Dev Services for Kafka uses: `vectorized/redpanda` images. You can select any version from https://hub.docker.com/r/vectorized/redpanda:
ja_jp: デフォルトでは、Kafka向けDev Servicesは、 `vectorized/redpanda:latest` を使用します。 https://hub.docker.com/r/vectorized/redpanda から任意のバージョンを選択することができます。

source: Dev Services for Keycloak initializes a launched Keycloak server next.
ja_jp: Dev Services for Keycloakは、起動したKeycloakサーバーを次に初期化します。

source: Dev Services for Keycloak is not activated if either `quarkus.oidc.auth-server-url` is already initialized or the default OIDC tenant is disabled with `quarkus.oidc.tenant.enabled=false`, regardless of whether you work with Keycloak or not.
ja_jp: `quarkus.oidc.auth-server-url` がすでに初期化されているか、デフォルトの OIDC テナントが `quarkus.oidc.tenant.enabled=false` で無効になっている場合、Keycloak を使用するかどうかにかかわらず、`Dev Services For Keycloak` はアクティブ化されません。

source: Dev Services for Kogito is automatically enabled unless:
ja_jp: Dev Services for Kogitoは以下の条件以外で自動的に有効になります。

source: Dev Services for Kogito relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running Data Index.
ja_jp: Dev Services for Kogitoは、ブローカーの起動にDockerを使用しています。お使いの環境がDockerをサポートしていない場合は、ブローカーを手動で起動するか、すでに稼働しているData Indexに接続する必要があります。

source: Dev Services for Kogito starts the container with the `kogito-dev-service-data-index` label which is used to identify the container.
ja_jp: Dev Services for Kogito は、コンテナを識別するために使用される `kogito-dev-service-data-index` のラベルでコンテナを起動します。

source: Dev Services for Kogito uses: `kiegroup/kogito-data-index-ephemeral` images. You can select any version from https://quay.io/repository/kiegroup/kogito-data-index-ephemeral?tab=tags.
ja_jp: Dev Services for Kogito `kiegroup/kogito-data-index-ephemeral` イメージを使用します。 https://quay.io/repository/kiegroup/kogito-data-index-ephemeral?tab=tags から任意のバージョンを選択できます。

source: Dev Services for Kubernetes automatically starts a Kubernetes API server (plus the required etcd) in dev mode and when running tests. So you don't have to start it manually. The application is configured automatically.
ja_jp: Dev Services for Kubernetesは、開発モードとテスト実行時にKubernetes APIサーバ（と必要なetcd）を自動的に起動します。そのため、手動で起動する必要はありません。アプリケーションは自動的に設定されます。

source: Dev Services for Kubernetes automatically starts a Kubernetes API server in dev mode and when running tests. So you don't have to start a Kubernetes cluster manually. The application is configured automatically.
ja_jp: Dev Services for Kubernetesは、開発モード時やテスト実行時にKubernetes APIサーバーを自動的に起動します。そのため、手動でKubernetesクラスタを起動する必要はありません。アプリケーションは自動的に設定されます。

source: Dev Services for Kubernetes is automatically enabled unless:
ja_jp: Dev Services for Kubernetesは、以下の場合を除き、自動的に有効化されます。

source: Dev Services for Kubernetes provides three different flavors of Kubernetes cluster. Each flavor supports different Kubernetes API versions. You can configure the flavor and version using the `quarkus.kubernetes-client.devservices.flavor` and `quarkus.kubernetes-client.devservices.api-version` properties:
ja_jp: Dev Services for Kubernetesは、3つの異なるフレーバーのKubernetesクラスタを提供します。各フレーバーは、異なるKubernetes APIバージョンをサポートしています。 フレーバーとバージョンは、 `quarkus.kubernetes-client.devservices.flavor` と `quarkus.kubernetes-client.devservices.api-version` プロパティを使用して設定することができます。

source: Dev Services for Kubernetes relies on Docker to start the API server. If your environment does not support Docker, you will need to start the Kubernetes cluster manually, or connect to an already running Kubernetes cluster. You can configure the Kubernetes cluster access using either a Kube config file or the various properties available in the https://github.com/quarkusio/quarkus/blob/main/extensions/kubernetes-client/runtime-internal/src/main/java/io/quarkus/kubernetes/client/runtime/KubernetesClientBuildConfig.java[KubernetesClientBuildConfig] class.
ja_jp: Dev Services for Kubernetesは、APIサーバーの起動にDockerを利用しています。お使いの環境がDockerをサポートしていない場合、Kubernetesクラスタを手動で起動するか、すでに稼働しているKubernetesクラスタに接続する必要があります。Kubernetesクラスタへのアクセスは、Kubeの設定ファイルか、 link:https://github.com/quarkusio/quarkus/blob/main/extensions/kubernetes-client/runtime-internal/src/main/java/io/quarkus/kubernetes/client/runtime/KubernetesClientBuildConfig.java[KubernetesClientBuildConfig] クラスで利用できる各種プロパティを使用して設定することができます。

source: Dev Services for Kubernetes relies on a container engine (Docker or Podman) to start the server. If your environment does not support such a container engine, you will have to start a Kubernetes cluster running in a VM, in the cloud, etc. In this case, you can configure the Kubernetes cluster access using either a Kube config file or the various properties available as specified in the xref:kubernetes-client.adoc[Kubernetes client configuration guide].
ja_jp: Dev Services for Kubernetes は、サーバーを起動するためにコンテナエンジン（Docker または Podman）に依存しています。お使いの環境がそのようなコンテナエンジンをサポートしていない場合は、VM、クラウドなどで実行されている Kubernetes クラスターを起動する必要があります。この場合、Kube config ファイルを使用するか、xref:kubernetes-client.adoc[Kubernetes client configuration guide] で指定されている利用可能な様々なプロパティーを使用して Kubernetes クラスターアクセスを設定できます。

source: Dev Services for Kubernetes relies on a container engine: Docker or Podman to start the server. If your environment does not support such a container engine, you will have to start a Kubernetes cluster running in a VM, in the cloud, etc. In this case, you can configure the Kubernetes cluster access using either a Kube config file or the various properties available in the https://github.com/quarkusio/quarkus/blob/main/extensions/kubernetes-client/runtime-internal/src/main/java/io/quarkus/kubernetes/client/runtime/KubernetesClientBuildConfig.java[KubernetesClientBuildConfig] class.
ja_jp: Dev Services for Kubernetesはコンテナエンジンに依存しています：サーバを起動するにはDockerまたはPodmanを使用します。 お使いの環境がそのようなコンテナエンジンをサポートしていない場合は、VMやクラウドなどで実行されているKubernetesクラスタを起動する必要があります。この場合、Kube configファイルまたは link:https://github.com/quarkusio/quarkus/blob/main/extensions/kubernetes-client/runtime-internal/src/main/java/io/quarkus/kubernetes/client/runtime/KubernetesClientBuildConfig.java[KubernetesClientBuildConfig] クラスで利用可能なさまざまなプロパティを使用して、Kubernetesクラスタへのアクセスを設定できます。

source: Dev Services for Kubernetes starts the api server container with the `quarkus-dev-service-kubernetes` label which is used to identify it.
ja_jp: Dev Services for Kubernetes は、API サーバーコンテナーを `quarkus-dev-service-kubernetes` というラベルで起動し、これにより識別されます。

source: Dev Services for Kubernetes starts the container with the `quarkus-dev-service-kubernetes` label which is used to identify the container.
ja_jp: Dev Services for Kubernetesは、コンテナの識別に使用される `quarkus-dev-service-kubernetes` ラベルを付与してコンテナを起動します。

source: Dev Services for LRA
ja_jp: LRA 用 Dev Services

source: Dev Services for LRA is automatically enabled unless:
ja_jp: LRA 用 Dev Services は、以下の場合を除き自動的に有効になります。

source: Dev Services for LRA relies on Docker or Podman to start the coordinator. If your environment does not support Docker, you will need to start the coordinator manually, or connect to an already running coordinator. You can configure the coordinator URL using `quarkus.lra.coordinator-url`.
ja_jp: LRA 用 Dev Services は、コーディネーターを起動するために Docker または Podman に依存します。お使いの環境が Docker をサポートしていない場合は、コーディネーターを手動で起動するか、既に実行中のコーディネーターに接続する必要があります。`quarkus.lra.coordinator-url` を使用して、コーディネーターの URL を設定できます。

source: Dev Services for LRA starts the container with the `quarkus-dev-service-lra-coordinator` label which is used to identify the container.
ja_jp: LRA 用 Dev Services は、コンテナーを識別するために使用される `quarkus-dev-service-lra-coordinator` ラベルを付けてコンテナーを起動します。

source: Dev Services for MongoDB
ja_jp: MongoDBのDev Services

source: Dev Services for MongoDB starts the container with the `quarkus-dev-service-mongodb` label which is used to identify the container.
ja_jp: Dev Services for MongoDB はコンテナを識別するための `quarkus-dev-service-mongodb` ラベルでコンテナを起動します。

source: Dev Services for Pulsar is automatically enabled unless:
ja_jp: 以下の場合を除き、Dev Services for Pulsar は自動的に有効になります。

source: Dev Services for Pulsar relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker address using `pulsar.client.`.
ja_jp: Dev Services for Pulsar は、ブローカーを起動するために Docker に依存しています。環境が Docker をサポートしていない場合は、ブローカーを手動で起動するか、すでに実行中のブローカーに接続する必要があります。 `pulsar.client.` を使用してブローカーアドレスを設定できます。

source: Dev Services for Pulsar starts the container with the `quarkus-dev-service-pulsar` label which is used to identify the container.
ja_jp: Dev Services for Pulsar は、コンテナーを識別するために使用される `quarkus-dev-service-pulsar` ラベルを使用してコンテナーを起動します。

source: Dev Services for Pulsar supports the https://hub.docker.com/r/apachepulsar/pulsar[official Apache Pulsar image].
ja_jp: Dev Services for Pulsar は、https://hub.docker.com/r/apachepulsar/pulsar[公式 Apache Pulsar イメージ] をサポートしています。

source: Dev Services for RabbitMQ automatically starts a RabbitMQ broker in dev mode and when running tests.
ja_jp: Dev Services for RabbitMQは、開発モードとテスト実行時に自動的にRabbitMQブローカーを起動します。

source: Dev Services for RabbitMQ automatically starts a RabbitMQ broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
ja_jp: Dev Services for RabbitMQは、開発モードやテストの実行時に自動的にRabbitMQブローカーを起動します。そのため、ブローカーを手動で起動する必要はありません。アプリケーションは自動的に設定されます。

source: Dev Services for RabbitMQ is automatically enabled unless:
ja_jp: Dev Services for RabbitMQは、以下の条件が満たされない限り自動的に有効化されます。

source: Dev Services for RabbitMQ relies on Docker to start the broker. If your environment does not support Docker, you must start the broker manually, or connect to an already running broker. You can configure the broker access by using the `rabbitmq-host`, `rabbitmq-port`, `rabbitmq-username` and `rabbitmq-password` properties.
ja_jp: Dev Services for RabbitMQ は、ブローカーの起動にDockerを使用しています。お使いの環境でDockerがサポートされていない場合は、ブローカーを手動で起動するか、すでに稼働しているブローカーに接続する必要があります。ブローカーのアクセスは、 `rabbitmq-host` 、 `rabbitmq-port` 、 `rabbitmq-username` 、 `rabbitmq-password` プロパティーを使用して設定できます。

source: Dev Services for RabbitMQ relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker access using the `rabbitmq-host`, `rabbitmq-port`, `rabbitmq-username` and `rabbitmq-password` properties.
ja_jp: Dev Services for RabbitMQは、ブローカーの起動にDockerを使用しています。お使いの環境でDockerがサポートされていない場合は、ブローカーを手動で起動するか、すでに稼働しているブローカーに接続する必要があります。ブローカーのアクセスは、 `rabbitmq-host` 、 `rabbitmq-port` 、 `rabbitmq-username` 、 `rabbitmq-password` プロパティを使用して設定できます。

source: Dev Services for RabbitMQ starts the container with the `quarkus-dev-service-rabbitmq` label which is used to identify the container.
ja_jp: Dev Services for RabbitMQ は、コンテナを識別するために使用される `quarkus-dev-service-rabbitmq` ラベルを付与してコンテナを起動します。

source: Dev Services for RabbitMQ starts the container with the `quarkus-dev-service-rabbitmq` label, which is used to identify the container.
ja_jp: Dev Services for RabbitMQ は、コンテナーを識別するために使用される `quarkus-dev-service-rabbitmq` ラベルを使用してコンテナーを起動します。

source: Dev Services for RabbitMQ supports defining topology upon broker start. You can define Exchanges, Queues, and Bindings using standard Quarkus configuration.
ja_jp: Dev Services for RabbitMQは、ブローカーの起動時にトポロジーの定義をサポートしています。標準的なQuarkusの設定を使用して、Exchange、Queue、Bindingsを定義できます。

source: Dev Services for RabbitMQ supports defining topology upon broker start. You can define Virtual Hosts, Exchanges, Queues, and Bindings through standard Quarkus configuration.
ja_jp: Dev Services for RabbitMQ は、ブローカーの起動時のトポロジー定義をサポートしています。標準の Quarkus 設定で Virtual Hosts、Exchanges、Queues、および Bindings を定義できます。

source: Dev Services for RabbitMQ uses official images available at https://hub.docker.com/_/rabbitmq. You can configure the image and version using the `quarkus.rabbitmq.devservices.image-name` property:
ja_jp: Dev Services for RabbitMQ は、 https://hub.docker.com/_/rabbitmq で入手できる公式イメージを使用しています。 `quarkus.rabbitmq.devservices.image-name` プロパティを使用して、イメージとバージョンを設定できます。

source: Dev Services for RabbitMQ uses official images available at https://hub.docker.com/_/rabbitmq. You can configure the image and version with the `quarkus.rabbitmq.devservices.image-name` property:
ja_jp: Dev Services for RabbitMQ は、https://hub.docker.com/_/rabbitmq で入手できる公式イメージを使用します。 `quarkus.rabbitmq.devservices.image-name` プロパティーを使用してイメージとバージョンを設定できます。

source: Dev Services for Redis relies on Docker to start the server. If your environment does not support Docker, you will need to start the server manually, or connect to an already running server.
ja_jp: Dev Services for Redisは、Dockerに依存してサーバーを起動します。お使いの環境がDockerをサポートしていない場合は、手動でサーバーを起動するか、すでに稼働しているサーバーに接続する必要があります。

source: Dev Services for Redis starts the container with the `quarkus-dev-service-redis` label which is used to identify the container.
ja_jp: Dev Services for Redis は、コンテナを識別するために使用される `quarkus-dev-service-redis` ラベルでコンテナを起動します。

source: Dev Services for databases automatically starts a database server in dev mode and when running tests. So, you don't have to start a server manually. The application is configured automatically.
ja_jp: Dev Services for Database は、開発モードやテストの実行時に自動的にデータベースサーバーを自動的も起動します。そのため、サーバーを手動で起動する必要はありません。アプリケーションは自動的に設定されます。

source: Dev Services for databases relies on Docker to start the server (except for H2 and Derby which are run in process). If your environment does not support Docker, you will need to start the server manually, or connect to an already running server.
ja_jp: Dev Services for database は、Dockerに依存してサーバーを起動します (インプロセスで実行される H2 と Derby を除く)。お使いの環境がDockerをサポートしていない場合は、手動でサーバーを起動するか、すでに稼働しているサーバーに接続する必要があります。

source: Dev Services for databases relies on Docker to start the server (except for H2 which is run in process). If your environment does not support Docker, you will need to start the server manually, or connect to an already running server.
ja_jp: データベースの Dev Services は、サーバーを起動するために Docker に依存しています (インプロセスで実行される H2 を除く)。Docker をサポートしていない環境では、サーバーを手動で起動するか、すでに稼働しているサーバーに接続する必要があります。

source: Dev Services start the required containers automatically when you are developing or testing your application.
ja_jp: Dev Servicesは、アプリケーションの開発やテストを行う際に、必要なコンテナを自動的に起動します。

source: Dev Services supports the following config options:
ja_jp: DevServicesは、以下の構成オプションをサポートしています。

source: Dev Services volumes can be mapped to the filesystem or the classpath:
ja_jp: Dev Servicesのボリュームは、ファイルシステムまたはクラスパスにマッピングすることができます:

source: Dev Tools Support
ja_jp: 開発ツールサポート

source: Dev UI State
ja_jp: Dev UI の状態

source: Dev UI extension for Apache Kafka for development purposes.
ja_jp: 開発目的のApache KafkaのDev UIエクステンションです。

source: Dev UI for all OpenID Connect Providers
ja_jp: すべての OpenID Connect プロバイダーの Dev UI

source: Dev UI for all OpenID Connect providers
ja_jp: すべてのOpenID ConnectプロバイダーのためのDev UI

source: Dev UI for extension developers
ja_jp: エクステンション開発者のためのDev UI

source: Dev UI has the following build-in state:
ja_jp: Dev UI は以下の組み込みの状態を備えています:

source: Dev UI makes extensive usage of https://vaadin.com/docs/latest/components[Vaadin web components] as UI Building blocks.
ja_jp: Dev UI では、UI ビルディングブロックとして https://vaadin.com/docs/latest/components[Vaadin Web コンポーネント] を広範に使用します。

source: Dev UI uses https://lit.dev/[Lit] to make building these web components easier. You can read more about Web Components and Lit:
ja_jp: Dev UI は、これらの Web コンポーネントの構築を容易にするために https://lit.dev/[Lit] を使用します。Web コンポーネントと Lit の詳細は、以下を参照してください。

source: Dev mode (local and remote)
ja_jp: 開発モード（ローカルおよびリモート）

source: Dev mode JVM options
ja_jp: 開発モードの JVM オプション

source: Dev mode and Testing
ja_jp: 開発モードとテスト

source: Dev mode dependencies on regular Maven artifacts
ja_jp: 通常の Maven アーティファクトに対する開発モードの依存関係

source: Dev mode enables hot deployment with background compilation, which means that when you modify your Java files or your resource files and refresh your browser these changes will automatically take effect. This works too for resource files like the configuration property file. The act of refreshing the browser triggers a scan of the workspace, and if any changes are detected the Java files are compiled, and the application is redeployed, then your request is serviced by the redeployed application. If there are any issues with compilation or deployment an error page will let you know.
ja_jp: Devモードでは、バックグラウンド・コンパイルによるホット・デプロイメントが可能です。つまり、Javaファイルやリソース・ファイルを変更してブラウザを更新すると、その変更が自動的に反映されます。これは、Javaファイルやリソースファイルを変更してブラウザを更新すると、その変更が自動的に反映されることを意味します。ブラウザを更新すると、ワークスペースのスキャンが行われ、変更が検出されると、Javaファイルがコンパイルされ、アプリケーションが再デプロイされ、再デプロイされたアプリケーションによってリクエストが処理されます。コンパイルやデプロイに問題があった場合は、エラーページでお知らせします。

source: Dev mode now comes with an interactive terminal. Press `:` when in dev mode to open it.
ja_jp: 開発モードにはインタラクティブターミナルが付属するようになりました。開発モードの時に `:` を押すと開きます。

source: Dev mode-only extension dependencies
ja_jp: 開発モードのみのエクステンションの依存関係

source: Dev mode-only extension dependencies can be configured in the Quarkus extension plugin in the following way:
ja_jp: 開発モード専用のエクステンションの依存関係は、Quarkus エクステンションプラグインで次のように設定できます。

source: Dev-mode features
ja_jp: 開発モードの機能

source: DevServices simplifies testing with containers.
ja_jp: DevServicesはコンテナでテストを簡素化します。

source: Develop and build your Quarkus application with Gradle
ja_jp: Gradleを使用したQuarkusアプリケーションの開発とビルド

source: Develop and build your Quarkus application with Maven
ja_jp: Mavenを使用したQuarkusアプリケーションの開発とビルド

source: Develop and test against services with zero configuration
ja_jp: ゼロ・コンフィギュレーションでサービスを開発し、テストする

source: Developer Joy
ja_jp: 開発者満足

source: Developer Joy is an important Quarkus principle. Here are some extension capabilities that contribute to joyful development.
ja_jp: 開発者の満足度は、Quarkus の重要な原則です。 開発を楽しむためのエクステンションケイパビリティーを紹介します。

source: Developer Joy:: for everything going from live reload to the opinionated layer to a single config file
ja_jp: Developer Joy:: ライブリロードから独自のレ​​イヤー、単一の設定ファイルに至るまでのすべてをサポート

source: Developer Productivity
ja_jp: 開発者生産性

source: Developer Productivity and Versatility
ja_jp: 開発者の生産性と汎用性

source: Developer experience is a key aspect of Quarkus, and we are constantly improving it.
ja_jp: 開発者体験はQuarkusの重要な側面であり、私たちは常にその改善を続けています。

source: Developer experience may be impacted negatively when using `persistence.xml` compared to when <<hibernate-configuration-properties,using `application.properties`>>, due to unavailable features, limited guidance in the Quarkus documentation, and error messages providing resolution hints that cannot be applied (e.g. using `quarkus.hibernate-orm.*` properties).
ja_jp: `persistence.xml` を使用する場合、<<hibernate-configuration-properties,using `application.properties`>> を使用する場合と比較して、利用できない機能、Quarkus ドキュメントでの限られたガイダンス、解決策を提供するエラーメッセージが適用できないこと (例: `quarkus.hibernate-orm.*` プロパティーの使用) などにより、開発者エクスペリエンスが悪影響を受ける可能性があります。

source: Developer experience: Live reload, build-time code generation, and native image support
ja_jp: 開発者体験: ライブリロード、ビルド時のコード生成、および Native Image サポート。

source: Developer joy is important, but so are observability, maintainability, and other operational considerations. Many of these characteristics come by default with the Quarkus framework or https://quarkus.io/extensions/io.quarkus/quarkus-opentelemetry/[observability-focussed extensions]. But extensions can do more.
ja_jp: 開発者の満足度は重要ですが、観測可能性、保守性、その他の運用上の考慮事項も重要です。 これらの特性の多くは、Quarkus フレームワークまたは https://quarkus.io/extensions/io.quarkus/quarkus-opentelemetry/[観測性重視のエクステンション] にデフォルトで付属しています。ただし、エクステンションではさらに多くのことが可能になります。

source: Developers are critical to the success of almost every organization and they need the tools to build cloud-native applications quickly and efficiently. Quarkus provides a frictionless development experience through a combination of tools, libraries, extensions, and more. Quarkus makes developers more efficient with tools to improve the inner loop development cycle while in dev mode.
ja_jp: 開発者は、ほぼすべての組織の成功に欠かせない存在であり、クラウドネイティブ アプリケーションを迅速かつ効率的に構築するためのツールを必要としています。Quarkus は、ツール、ライブラリー、エクステンションなどの組み合わせにより、フリクションレスな開発エクスペリエンスを提供します。Quarkus は、開発モード中にインナー ループ開発サイクルを改善するツールを使用して、開発者の効率を高めます。

source: Developers can further customize JSON processing by implementing the `ObjectMapperCustomizer` interface. This interface allows fine-grained control over the `ObjectMapper`, enabling the registration of custom serializers and deserializers while ensuring compatibility with the reflection-free optimization. If additional configuration is needed, implement an `ObjectMapperCustomizer` bean and register any necessary modules or settings.
ja_jp: 開発者は、 `ObjectMapperCustomizer` インタフェースを実装することで、JSON処理をさらにカスタマイズできます。 このインターフェースは、 `ObjectMapper` に対するきめ細かい制御を可能にし、リフレクションフリーの最適化との互換性を確保しながら、カスタムのシリアライザーとデシリアライザーの登録を可能にします。追加の設定が必要な場合は、 `ObjectMapperCustomizer` Bean を実装し、必要なモジュールや設定を登録します。

source: Developers now have three options to build and deploy functions to AWS Lambda; JVM mode, Native mode, and the latest inclusion of the SnapStart feature. All three have different use cases. It is important to note that SnapStart is an AWS Lambda feature only.
ja_jp: AWS Lambdaに関数をビルドしてデプロイするには、JVMモード、Nativeモード、そして今回追加されたSnapStartの3つのオプションがあります。この3つはすべて異なるユースケースを持っています。SnapStartはAWS Lambdaの機能であることに注意することが重要です。

source: Developing OpenID Connect Web App Applications
ja_jp: OpenID Connect Web アプリケーションの開発

source: Developing OpenID Connect web-app applications
ja_jp: OpenID Connectウェブアプリケーション開発

source: Developing REST Services with RESTEasy Classic
ja_jp: RESTEasy ClassicによるRESTサービスの開発

source: Developing Service Applications
ja_jp: サービスアプリケーションの開発

source: Developing service applications
ja_jp: サービスアプリケーションの開発
